**Those who don't know about basic markdown syntax**

main advantage of jupyter notebook
    1. we can do documentation
    2. programming

**There are mainly 2 modes available**

* code mode for programming
* markdown mode for documentation

#### mark down syntax

# head1
## head2
### head3
#### head4
##### head5
###### head6

**Machine** Learning using python

**shortcuts in jupyter notebook**

**to run the current cell**

shift Enter

**to create new cell above the current cell**

esc a

**to create new cell below the current cell**

esc b

**to delete the current cell**

esc d d

**to change current cell into markdown cell**

esc m

**to change current cell into code cell**

esc y

#### Working with simple csv files

**how to read csv file in python?**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salary.csv') # DataFrame

In [3]:
print(df)

   Experience  Salary
0           1   10000
1           2   20000
2           3   30000
3           4   40000
4           5     NaN
5           6   60000
6           7   70000
7           8  APSSDC
8           9   90000
9          10  120000

**How many rows and how many columns available?**

In [5]:
df.shape # (rows,columns)

(10, 2)

**is there any missing values?**

In [7]:
df.isna().sum()

Experience    0
Salary        1
dtype: int64

**filling the missing value with default value**

In [8]:
df.fillna(50000)
# df = df.fillna(50000)

   Experience  Salary
0           1   10000
1           2   20000
2           3   30000
3           4   40000
4           5   50000
5           6   60000
6           7   70000
7           8  APSSDC
8           9   90000
9          10  120000

**removing rows it has missing values**

In [10]:
df.dropna()

   Experience  Salary
0           1   10000
1           2   20000
2           3   30000
3           4   40000
5           6   60000
6           7   70000
7           8  APSSDC
8           9   90000
9          10  120000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
Experience    10 non-null int64
Salary        9 non-null object
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [16]:
df.drop(7)

   Experience  Salary
0           1   10000
1           2   20000
2           3   30000
3           4   40000
4           5     NaN
5           6   60000
6           7   70000
8           9   90000
9          10  120000

**https://github.com/AP-State-Skill-Development-Corporation/Machine-Learning-Using-Python-MB7**

**every day after 1pm you can check for recorded session**